src/Documents/ИС_Сбер_УпаковкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Сбер_УпаковкаТоваров</Name>
			<Comment>ИнфоСофт Власова И.С. 22.03.24 УА #71520</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПечатиЭтикеток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_НастройкиПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИС_Сбер_Отправление</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтикеткаРаспечатана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_Сбер_Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Сбер_Товары</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>offerID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ДанныеВыгрузкиКИЗов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ДанныеВыгрузкиКИЗов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВыгруженныхТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказМП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_Ozon_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_АЛИ_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_ЯМ_Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_WB_СборочноеЗадание</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ИС_Сбер_Отправление</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_Сбер_СтатусыОтправлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_Сбер_СтатусыОтправлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MERCHANT_CANCELED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NEW</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING_CONFIRMATION</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CONFIRMED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING_PACKING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PACKED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PENDING_SHIPPING</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SHIPPED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PACKING_EXPIRED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SHIPPING_EXPIRED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELIVERED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CUSTOMER_CANCELED</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ШтрихкодыУпаковокТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыУпаковокТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗначениеШтрихкода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_Сбер_УпаковкаТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы   

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Параметры.Свойство("Профиль") Тогда	
			Объект.Профиль = Параметры.Профиль;
		КонецЕсли;
		
		МассивЗаказов = Новый Массив;
		
		Если Параметры.Свойство("ВыделенныеСтроки") Тогда
			МассивЗаказов = Параметры.ВыделенныеСтроки;
		КонецЕсли;
		
		ЗаполнитьДанныеЗаказаНаСервере(МассивЗаказов);
		
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		
	Иначе		
		ЗаполнитьДеревоНоменклатурыПоТЧ();	
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Дерево = ДеревоЗаказы.ПолучитьЭлементы();
	
	Для Каждого Строка Из Дерево Цикл
		Если Строка.ЭтикеткаРаспечатана Тогда
			Элементы.ДеревоЗаказы.Свернуть(Строка.ПолучитьИдентификатор());
		Иначе	
			Элементы.ДеревоЗаказы.Развернуть(Строка.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Отказ Тогда
		
		ТекущийОбъект.Товары.Очистить();
		
		Дерево = РеквизитФормыВЗначение("ДеревоЗаказы");
		ПреобразоватьДеревоВТаблицуЗначений(Дерево, ТекущийОбъект);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			СтруктураШтрихкод = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			ОбработатьШтрихкоды(СтруктураШтрихкод.Штрихкод);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	ЗаполнитьДанныеЗаказа();
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

#КонецОбласти 

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ВвестиШтрихкодВручную(Команда)

	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #93336	
	//ШтрихкодированиеИСКлиент.ПоказатьВводШтрихкода(Оповещение);
	ИС_MP_МаркировкаКлиент.ПоказатьВводШтрихкода(Оповещение);
	//- ИнфоСофт Власова И.С. 13.02.25 УА #93336
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура Подключаемый_ОткрытьФормуУточненияДанных() Экспорт		
	ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка штрихкода завершилось с ошибкой! Данные не найдены по штрихкоду!");
	Возврат;		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997     

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Функция ОписаниеОповещенияОбработкиКодаМаркировки()	
	Возврат Новый ОписаниеОповещения("ОбработатьШтрихкодыЗавершение", ЭтотОбъект);	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура ОбработатьШтрихкодыЗавершение(Результат, Параметры) Экспорт 	
	ВыполнитьПроверкуНаПечать(Результат);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997
&НаКлиенте
Процедура ОбработатьШтрихкоды(Штрихкод)
	
	ОчиститьСообщения();
	
	ДанныеШтрихкода = Новый Структура; 
	
	ДанныеШтрихкода.Вставить("ФорматBase64", Ложь); 
	ДанныеШтрихкода.Вставить("Штрихкод", СокрЛП(Штрихкод));
	ДанныеШтрихкода.Вставить("Количество", 1);
	
	//+ ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87857	
	ИС_MP_МаркировкаКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода); 
	
	ПараметрыСканирования = ИС_MP_МаркировкаКлиент.ПараметрыСканирования(ЭтаФорма);  
	
	//+ ИнфоСофт Заварин К.В. 13.03.25 УА #96054
	ПараметрыСканирования.Вставить("ТребуетсяПроверкаСредствамиККТ", Ложь);
	//- ИнфоСофт Заварин К.В. 13.03.25 УА #96054
	
	РезультатОбработкиШтрихкода = ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования);
	
	ВыполнитьПроверкуНаПечать(РезультатОбработкиШтрихкода);
	
	//ИС_MP_МаркировкаКлиент.ОбработатьДанныеШтрихкода("ОбработатьШтрихкодыЗавершение", ЭтаФорма, ДанныеШтрихкода);
	//- ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87857
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 28.06.24 УА #77997

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Данные, ДополнительныеПараметры) Экспорт
	
	Если Данные.Штрихкод <> "" Тогда
		ОбработатьШтрихкоды(СокрЛП(Данные.Штрихкод));
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоЗаказы.ЭтикеткаРаспечатана");
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование  = Истина;
	
	ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоЗаказы.Имя);
	ОформляемоеПоле.Использование = Истина;
	
КонецПроцедуры

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ПреобразоватьДеревоВТаблицуЗначений(ДеревоЗначений, ТекущийОбъект)
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		Если Строка.Строки.Количество() = 0 Тогда
			
			НоваяСтрока = ТекущийОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
		ИначеЕсли Строка.Строки.Количество() > 0 Тогда
			
			ПреобразоватьДеревоВТаблицуЗначений(Строка, ТекущийОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ЗаполнитьДеревоНоменклатурыПоТЧ()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Сбер_УпаковкаТоваровТовары.Заказ КАК Заказ,
		|	ИС_Сбер_УпаковкаТоваровТовары.Номенклатура КАК Номенклатура,
		|	ИС_Сбер_УпаковкаТоваровТовары.Характеристика КАК Характеристика,
		|	ИС_Сбер_УпаковкаТоваровТовары.КоличествоЗаказ КАК КоличествоЗаказ,
		|	ИС_Сбер_УпаковкаТоваровТовары.КоличествоФакт КАК КоличествоФакт,
		|	ИС_Сбер_УпаковкаТоваровТовары.ЭтикеткаРаспечатана КАК ЭтикеткаРаспечатана
		|ИЗ
		|	Документ.ИС_Сбер_УпаковкаТоваров.Товары КАК ИС_Сбер_УпаковкаТоваровТовары
		|ГДЕ
		|	ИС_Сбер_УпаковкаТоваровТовары.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(КоличествоЗаказ),
		|	СУММА(КоличествоФакт),
		|	МИНИМУМ(ЭтикеткаРаспечатана)
		|ПО
		|	Заказ";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(РезультатЗапроса, "ДеревоЗаказы");
 
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ЗаполнитьДанныеЗаказа()
	
	Если ДеревоЗаказы.ПолучитьЭлементы().Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершениеЗаполнениеТаблицы", ЭтотОбъект);
		ТекстВопроса = "Перезаполнить таблицу? Данные в табличной части будут утеряны.";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьДанныеЗаказаНаСервере();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ПоказатьВопросЗавершениеЗаполнениеТаблицы(Результат, Объект) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДанныеЗаказаНаСервере();
	Иначе
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Процедура ЗаполнитьДанныеЗаказаНаСервере(МассивЗаказов = Неопределено)
	
	Объект.Товары.Очистить();
	ДеревоЗаказы.ПолучитьЭлементы().Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	//+ ИнфоСофт Заварин К.В. 24.02.25 УА #73904
	"ВЫБРАТЬ
	|	ИС_Сбер_Отправление.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СборочныеЗадания
	|ИЗ
	|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
	|ГДЕ
	|	ИС_Сбер_Отправление.Профиль = &Профиль
	|	И &ОтборЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Сбер_Отправление_items.Ссылка КАК Заказ,
	|	ИС_Сбер_Товары.Номенклатура КАК Номенклатура,
	|	ИС_Сбер_Товары.Характеристика КАК Характеристика,
	|	СУММА(ИС_Сбер_Отправление_items.quantity) КАК КоличествоЗаказ,
	|	ВЫБОР
	|		КОГДА ИС_Сбер_Товары.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МаркируемыйТовар
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправление_items
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
	|		ПО ИС_Сбер_Отправление_items.offerId = ИС_Сбер_Товары.offerID
	|			И (ИС_Сбер_Товары.ЛичныйКабинет = &Профиль)
	|ГДЕ
	|	ИС_Сбер_Отправление_items.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_СборочныеЗадания.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_СборочныеЗадания КАК ВТ_СборочныеЗадания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_Сбер_Отправление_items.Ссылка,
	|	ИС_Сбер_Товары.Номенклатура,
	|	ИС_Сбер_Товары.Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_Сбер_Товары.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Заказ КАК Заказ,
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика,
	|	ВТ_Номенклатура.КоличествоЗаказ КАК КоличествоЗаказ,
	|	0 КАК КоличествоФакт,
	|	""Ложь"" КАК ЭтикеткаРаспечатана,
	|	ВТ_Номенклатура.МаркируемыйТовар КАК МаркируемыйТовар,
	|	ВЫБОР
	|		КОГДА ИС_MP_ДанныеВыгрузкиКИЗов.КоличествоВыгруженныхТоваров = ВТ_Номенклатура.КоличествоЗаказ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МаркировкаПередана
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ДанныеВыгрузкиКИЗов КАК ИС_MP_ДанныеВыгрузкиКИЗов
	|		ПО ВТ_Номенклатура.Номенклатура = ИС_MP_ДанныеВыгрузкиКИЗов.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ИС_MP_ДанныеВыгрузкиКИЗов.Характеристика
	|			И ВТ_Номенклатура.Заказ = ИС_MP_ДанныеВыгрузкиКИЗов.ЗаказМП
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказ
	|ИТОГИ
	|	СУММА(КоличествоЗаказ)
	|ПО
	|	Заказ";
	//- ИнфоСофт Заварин К.В. 24.02.25 УА #73904
	
	Если МассивЗаказов = Неопределено ИЛИ МассивЗаказов.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("ОтборЗаказов", Истина);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборЗаказов", "ИС_Сбер_Отправление.Ссылка В(&МассивЗаказов)");
		Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	КонецЕсли;
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.PACKED);
	МассивСтатусов.Добавить(Перечисления.ИС_Сбер_СтатусыОтправлений.CONFIRMED);
	
	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(РезультатЗапроса, "ДеревоЗаказы");	
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520	

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ВыполнитьПроверкуНаПечать(РезультатОбработкиШтрихкода)
	
	//+ ИнфоСофт Стояк Ю.К. 19.11.2024 УА #8785	
	ДанныеШтрихкода = РезультатОбработкиШтрихкода.ДанныеШтрихкода;
	//ДанныеШтрихкода = РезультатОбработкиШтрихкода;
	//- ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87857
	
	РезультатРазбора = РазборКодаМаркировкиНаСервере(ДанныеШтрихкода.НормализованныйШтрихкод);
	
	Если РезультатРазбора <> Неопределено Тогда
		ДанныеШтрихкодаУпаковки = ПолучитьДанныеШтрихкодаУпаковки(РезультатРазбора);
		ДанныеШтрихкода = ДанныеШтрихкодаУпаковки;
	Иначе
		ДанныеШтрихкодаУпаковки = Неопределено;
	КонецЕсли;
	
	Если ДанныеШтрихкодаУпаковки = Неопределено И Не ЗначениеЗаполнено(ДанныеШтрихкода.Номенклатура) Тогда
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ЗвукШтрихкодОтстутствуетВБазе();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не найдены данные по коду " + ДанныеШтрихкода.Штрихкод);
		Возврат;		
	КонецЕсли;	
	
	Дерево = ДеревоЗаказы.ПолучитьЭлементы();
	
	ТекущийЗаказ = Неопределено;
	СтрокаДанныеСборки = Неопределено;   
	
	Для Каждого Заказ Из Дерево Цикл
		
		СтрокиЗаказа = Заказ.ПолучитьЭлементы();
		
		Если СтрокиЗаказа.Количество() > 0 Тогда 
			
			Для Каждого Строка Из СтрокиЗаказа Цикл 
				
				Если Строка.Номенклатура = ДанныеШтрихкода.Номенклатура И Строка.Характеристика = ДанныеШтрихкода.Характеристика И Не Строка.ЭтикеткаРаспечатана Тогда
					
					ТекущийЗаказ = Заказ;
					СтрокаДанныеСборки = Строка;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтрокаДанныеСборки <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если СтрокаДанныеСборки = Неопределено Тогда
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762 	 
		ЗвукТоварОтсутствуетВЗаказе();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
		ОбщегоНазначенияКлиент.СообщитьПользователю("По отсканированному штрихкоду не найдено доступного заказа для печати этикетки.");
		Возврат;
		//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
	Иначе		
		ЗвукТоварНайден();
		//- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
	КонецЕсли;	
	
	ЭтикеткаРаспечатана = Ложь;
	
	СтрокаДанныеСборки.КоличествоФакт = СтрокаДанныеСборки.КоличествоФакт + 1;
	ТекущийЗаказ.КоличествоФакт       = ТекущийЗаказ.КоличествоФакт + 1;
	
	Если СтрокаДанныеСборки.КоличествоФакт = СтрокаДанныеСборки.КоличествоЗаказ Тогда
		
		НужноПечатать = Истина;
		СтрокаДанныеСборки.ЭтикеткаРаспечатана = Истина;
		
		СтрокиПоЗаказу = ТекущийЗаказ.ПолучитьЭлементы();
		
		Если СтрокиПоЗаказу.Количество() > 1 Тогда
			
			Для Каждого Строка Из СтрокиПоЗаказу Цикл
				
				Если Строка.КоличествоФакт <> Строка.КоличествоЗаказ Тогда				
					НужноПечатать = Ложь;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НужноПечатать Тогда
			
			Попытка
				
				ВыполнитьПечатьЭтикетки(СтрокаДанныеСборки); 
				
				ТекущийЗаказ.ЭтикеткаРаспечатана = ЭтикеткаРаспечатана;
				
				Элементы.ДеревоЗаказы.Свернуть(ТекущийЗаказ.ПолучитьИдентификатор());
				
			Исключение
				ОбщегоНазначенияКлиент.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаКлиенте
Процедура ВыполнитьПечатьЭтикетки(СтрокаДанныеСборки) 
	
	Результат = ПолучитьЭтикеткиНаСервере(СтрокаДанныеСборки.Заказ);
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось получить этикетки с сервера СберМегаМаркет!");
		Возврат;
	КонецЕсли;
	
	ДанныеЭтикетки = ПолучитьИзВременногоХранилища(Результат);
	
	Если ЗначениеЗаполнено(Объект.НастройкаПечатиЭтикеток) Тогда 		
		ПринтерДляПечати = """" + ПолучитьПринтерДляПечати() + """";
	Иначе	
		ПринтерДляПечати = "";
	КонецЕсли;
	
	ИмяКаталогаВременныхФайлов = КаталогВременныхФайлов();
	
	ИмяВременногоФайла = ИмяКаталогаВременныхФайлов + "stickersFile.pdf";

	ДанныеЭтикетки.Записать(ИмяВременногоФайла);
	
	ИС_МП_Клиент.НапечататьИзПриложения(ИмяВременногоФайла, ПринтерДляПечати);
	
	ЭтикеткаРаспечатана = Истина;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция ПолучитьЭтикеткиНаСервере(СборочноеЗадание)

	МассивЗаданий = Новый Массив;
	МассивЗаданий.Добавить(СборочноеЗадание);
	
	Возврат ИС_Сбер_Сервер.ПолучитьЭтикетки(Объект.Профиль, МассивЗаданий);
	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция ПолучитьДанныеШтрихкодаУпаковки(РезультатРазбора) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыУпаковокТоваров.Ссылка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", РезультатРазбора.НормализованныйКодМаркировки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Результат = Новый Структура;
	
	Результат.Вставить("Номенклатура", Выборка.Номенклатура);
	Результат.Вставить("Характеристика", Выборка.Характеристика);
	Результат.Вставить("НормализованныйШтрихкод", РезультатРазбора.КодМаркировки); 
	Результат.Вставить("ШтрихкодУпаковки", Выборка.Ссылка);
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция ПолучитьПринтерДляПечати()	
	Возврат Объект.НастройкаПечатиЭтикеток.ИмяПринтера;	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Власова И.С. 22.03.24 УА #71520
&НаСервере
Функция РазборКодаМаркировкиНаСервере(НормализованныйШтрихкод)	
	Возврат ИС_MP_Маркировка.РазборКодаМаркировки(НормализованныйШтрихкод);	
КонецФункции //- ИнфоСофт Власова И.С. 22.03.24 УА #71520

//+ ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87857
&НаСервере
Функция ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения = Неопределено)

	Возврат ИС_MP_Маркировка.ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения, ЭтаФорма.УникальныйИдентификатор);	
			
КонецФункции //- ИнфоСофт Стояк Ю.К. 19.11.2024 УА #87857

//+ ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762
&НаСервере
Функция ПолучитьЗначениеПараметра()
	
	МассивНаименованийПараметров = Новый Массив;  	
	МассивНаименованийПараметров.Добавить("ПроигрыватьЗвукиПриСканировании");
		
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Объект.Профиль, Перечисления.ИС_МП_Маркетплейсы.Сбер, МассивНаименованийПараметров);
	
	//+ ИнфоСофт Власова И.С. 04.02.25 УА #92991
	//Если Настройки.Свойство("ПроигрыватьЗвукиПриСканировании") Тогда
	Если Настройки.Свойство("ПроигрыватьЗвукиПриСканировании") И Не Настройки.ПроигрыватьЗвукиПриСканировании = Неопределено Тогда
	//- ИнфоСофт Власова И.С. 04.02.25 УА #92991
		Возврат Настройки.ПроигрыватьЗвукиПриСканировании;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции //- ИнфоСофт Янгиров Р.Р. 14.11.2024 УА #86762


//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762 
//Реализован функционал воспроизведения дополнительного звука при сканировании товаров в документе "УпаковкаТоваров"
&НаКлиенте
Процедура ПроигратьЗвук(ИмяФайла) 
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	//+ ИнфоСофт Власова И.С. 27.01.25 УА #91984
	//Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
	//	Или Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
		И Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		Возврат;
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 27.01.25 УА #91984
	
	Константа = ПолучитьЗначениеПараметра(); 
	
	Если Константа Тогда  
		oVoice = Новый COMObject("SAPI.SpVoice");
		oSpFileStream = Новый COMObject("SAPI.SpFileStream");
		oSpFileStream.Open(ИмяФайла);
		oVoice.SpeakStream(oSpFileStream);
		oSpFileStream.Close();
	Иначе
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукТоварНайден()
	
	ИмяФайла = КаталогДокументов() + "scanOK.wav";
	ПроигратьЗвук(ИмяФайла);
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукТоварОтсутствуетВЗаказе()
	
	ИмяФайла = КаталогДокументов() + "scanAlarm.wav";
	ПроигратьЗвук(ИмяФайла); 
	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

//+ ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762
&НаКлиенте
Процедура ЗвукШтрихкодОтстутствуетВБазе()
	ИмяФайла = КаталогДокументов() + "scanERROR.wav";
	ПроигратьЗвук(ИмяФайла); 	
КонецПроцедуры //- ИнфоСофт Янгиров Р.Р. 20.11.2024 УА #86762

#КонецОбласти
